### Forest Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.digitalocean_volume.forest_storage: Refreshing state... [id=9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=a2a46585217a8ca0a7c9828e25ad21fd5798c5fb]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=7689cfe1ae65ee3c2c2750d706d760db0bc25a5b]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=361519952]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=64dd4d5d-e4af-4b9a-85f6-d92574fd2ef6]
module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage: Refreshing state... [id=361519952-9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f-20230620141247850700000001]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-20T14:11:49Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "361519952" -> (known after apply)
      ~ ipv4_address         = "161.35.206.63" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:361519952" -> (known after apply)
      ~ user_data            = "0c60eacf7dcf0c903e70c3729b212f1e53bda9be" -> "6aec7a3d5c3a668fd2dcf9e4198e4152aaaba767" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [
          - "9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 361519952,
        ] -> (known after apply)
        id              = "64dd4d5d-e4af-4b9a-85f6-d92574fd2ef6"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:361519952",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage must be replaced
-/+ resource "digitalocean_volume_attachment" "attach_forest_storage" {
      ~ droplet_id = 361519952 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "361519952-9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f-20230620141247850700000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "161.35.206.63",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>